export const moon = {
  'theme': 
    <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth="1.5" stroke="currentColor" className="w-6 h-6">
      <path strokeLinecap="round" strokeLinejoin="round" d="M21.752 15.002A9.72 9.72 0 0 1 18 15.75c-5.385 0-9.75-4.365-9.75-9.75 0-1.33.266-2.597.748-3.752A9.753 9.753 0 0 0 3 11.25C3 16.635 7.365 21 12.75 21a9.753 9.753 0 0 0 9.002-5.998Z" />
    </svg>,
};

export const sun = {
  'theme':
    <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth="1.5" stroke="white" className="w-6 h-6">
      <path strokeLinecap="round" strokeLinejoin="round" d="M12 3v2.25m6.364.386-1.591 1.591M21 12h-2.25m-.386 6.364-1.591-1.591M12 18.75V21m-4.773-4.227-1.591 1.591M5.25 12H3m4.227-4.773L5.636 5.636M15.75 12a3.75 3.75 0 1 1-7.5 0 3.75 3.75 0 0 1 7.5 0Z" />
    </svg>
};

export const cross = {
  'exit': 
  <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth="3.5" stroke="currentColor" className="w-6 h-6">
    <path strokeLinecap="round" strokeLinejoin="round" d="M6 18 18 6M6 6l12 12" />
  </svg>
}; 

export const icons = {
    'home': {
      icon: [
        <path key={10} d="M11.47 3.841a.75.75 0 0 1 1.06 0l8.69 8.69a.75.75 0 1 0 1.06-1.061l-8.689-8.69a2.25 2.25 0 0 0-3.182 0l-8.69 8.69a.75.75 0 1 0 1.061 1.06l8.69-8.689Z" />,
        <path key={20} d="m12 5.432 8.159 8.159c.03.03.06.058.091.086v6.198c0 1.035-.84 1.875-1.875 1.875H15a.75.75 0 0 1-.75-.75v-4.5a.75.75 0 0 0-.75-.75h-3a.75.75 0 0 0-.75.75V21a.75.75 0 0 1-.75.75H5.625a1.875 1.875 0 0 1-1.875-1.875v-6.198a2.29 2.29 0 0 0 .091-.086L12 5.432Z" />
      ],
      text: ['Главная',],
    },
    'about': { 
      icon: [
        <path key={30} fillRule="evenodd" d="M7.5 6a4.5 4.5 0 1 1 9 0 4.5 4.5 0 0 1-9 0ZM3.751 20.105a8.25 8.25 0 0 1 16.498 0 .75.75 0 0 1-.437.695A18.683 18.683 0 0 1 12 22.5c-2.786 0-5.433-.608-7.812-1.7a.75.75 0 0 1-.437-.695Z" clipRule="evenodd" />,
      ],
      text: ['Обо мне',]
    },
    'portfolio': {
      icon: [
        <path key={40} fillRule="evenodd" d="M7.5 5.25a3 3 0 0 1 3-3h3a3 3 0 0 1 3 3v.205c.933.085 1.857.197 2.774.334 1.454.218 2.476 1.483 2.476 2.917v3.033c0 1.211-.734 2.352-1.936 2.752A24.726 24.726 0 0 1 12 15.75c-2.73 0-5.357-.442-7.814-1.259-1.202-.4-1.936-1.541-1.936-2.752V8.706c0-1.434 1.022-2.7 2.476-2.917A48.814 48.814 0 0 1 7.5 5.455V5.25Zm7.5 0v.09a49.488 49.488 0 0 0-6 0v-.09a1.5 1.5 0 0 1 1.5-1.5h3a1.5 1.5 0 0 1 1.5 1.5Zm-3 8.25a.75.75 0 1 0 0-1.5.75.75 0 0 0 0 1.5Z" clipRule="evenodd" />,
        <path key={50} d="M3 18.4v-2.796a4.3 4.3 0 0 0 .713.31A26.226 26.226 0 0 0 12 17.25c2.892 0 5.68-.468 8.287-1.335.252-.084.49-.189.713-.311V18.4c0 1.452-1.047 2.728-2.523 2.923-2.12.282-4.282.427-6.477.427a49.19 49.19 0 0 1-6.477-.427C4.047 21.128 3 19.852 3 18.4Z" />
      ],
      text: ['Портфолио',]
    },
    'contact': {
      icon: [
        <path key={60} d="M19.5 22.5a3 3 0 0 0 3-3v-8.174l-6.879 4.022 3.485 1.876a.75.75 0 1 1-.712 1.321l-5.683-3.06a1.5 1.5 0 0 0-1.422 0l-5.683 3.06a.75.75 0 0 1-.712-1.32l3.485-1.877L1.5 11.326V19.5a3 3 0 0 0 3 3h15Z" />,
        <path key={70} d="M1.5 9.589v-.745a3 3 0 0 1 1.578-2.642l7.5-4.038a3 3 0 0 1 2.844 0l7.5 4.038A3 3 0 0 1 22.5 8.844v.745l-8.426 4.926-.652-.351a3 3 0 0 0-2.844 0l-.652.351L1.5 9.589Z" />
      ],
      text: ['Связаться',]
    },
  };

  export const moreBtn = {
    'arrow': 
      <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth="6" stroke="white" className="w-6 h-6">
        <path strokeLinecap="round" strokeLinejoin="round" d="M13.5 4.5 21 12m0 0-7.5 7.5M21 12H3" />
      </svg>,
    'down':
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="white" className="w-6 h-6">
        <path fillRule="evenodd" d="M5.478 5.559A1.5 1.5 0 0 1 6.912 4.5H9A.75.75 0 0 0 9 3H6.912a3 3 0 0 0-2.868 2.118l-2.411 7.838a3 3 0 0 0-.133.882V18a3 3 0 0 0 3 3h15a3 3 0 0 0 3-3v-4.162c0-.299-.045-.596-.133-.882l-2.412-7.838A3 3 0 0 0 17.088 3H15a.75.75 0 0 0 0 1.5h2.088a1.5 1.5 0 0 1 1.434 1.059l2.213 7.191H17.89a3 3 0 0 0-2.684 1.658l-.256.513a1.5 1.5 0 0 1-1.342.829h-3.218a1.5 1.5 0 0 1-1.342-.83l-.256-.512a3 3 0 0 0-2.684-1.658H3.265l2.213-7.191Z" clipRule="evenodd" />
        <path fillRule="evenodd" d="M12 2.25a.75.75 0 0 1 .75.75v6.44l1.72-1.72a.75.75 0 1 1 1.06 1.06l-3 3a.75.75 0 0 1-1.06 0l-3-3a.75.75 0 0 1 1.06-1.06l1.72 1.72V3a.75.75 0 0 1 .75-.75Z" clipRule="evenodd" />
      </svg>
  };

  export const currentPage = {
    homePage: 'home',
    aboutPage: 'about',
    portfolioPage: 'portfolio',
    contactPage: 'contact',
  };

  export const expEdu = {
    'exp': 
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="white" className="w-5 h-5">
        <path fillRule="evenodd" d="M7.5 5.25a3 3 0 0 1 3-3h3a3 3 0 0 1 3 3v.205c.933.085 1.857.197 2.774.334 1.454.218 2.476 1.483 2.476 2.917v3.033c0 1.211-.734 2.352-1.936 2.752A24.726 24.726 0 0 1 12 15.75c-2.73 0-5.357-.442-7.814-1.259-1.202-.4-1.936-1.541-1.936-2.752V8.706c0-1.434 1.022-2.7 2.476-2.917A48.814 48.814 0 0 1 7.5 5.455V5.25Zm7.5 0v.09a49.488 49.488 0 0 0-6 0v-.09a1.5 1.5 0 0 1 1.5-1.5h3a1.5 1.5 0 0 1 1.5 1.5Zm-3 8.25a.75.75 0 1 0 0-1.5.75.75 0 0 0 0 1.5Z" clipRule="evenodd" />
        <path d="M3 18.4v-2.796a4.3 4.3 0 0 0 .713.31A26.226 26.226 0 0 0 12 17.25c2.892 0 5.68-.468 8.287-1.335.252-.084.49-.189.713-.311V18.4c0 1.452-1.047 2.728-2.523 2.923-2.12.282-4.282.427-6.477.427a49.19 49.19 0 0 1-6.477-.427C4.047 21.128 3 19.852 3 18.4Z" />
      </svg>,
    'edu': 
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="white" className="w-5 h-5">
        <path d="M11.7 2.805a.75.75 0 0 1 .6 0A60.65 60.65 0 0 1 22.83 8.72a.75.75 0 0 1-.231 1.337 49.948 49.948 0 0 0-9.902 3.912l-.003.002c-.114.06-.227.119-.34.18a.75.75 0 0 1-.707 0A50.88 50.88 0 0 0 7.5 12.173v-.224c0-.131.067-.248.172-.311a54.615 54.615 0 0 1 4.653-2.52.75.75 0 0 0-.65-1.352 56.123 56.123 0 0 0-4.78 2.589 1.858 1.858 0 0 0-.859 1.228 49.803 49.803 0 0 0-4.634-1.527.75.75 0 0 1-.231-1.337A60.653 60.653 0 0 1 11.7 2.805Z" />
        <path d="M13.06 15.473a48.45 48.45 0 0 1 7.666-3.282c.134 1.414.22 2.843.255 4.284a.75.75 0 0 1-.46.711 47.87 47.87 0 0 0-8.105 4.342.75.75 0 0 1-.832 0 47.87 47.87 0 0 0-8.104-4.342.75.75 0 0 1-.461-.71c.035-1.442.121-2.87.255-4.286.921.304 1.83.634 2.726.99v1.27a1.5 1.5 0 0 0-.14 2.508c-.09.38-.222.753-.397 1.11.452.213.901.434 1.346.66a6.727 6.727 0 0 0 .551-1.607 1.5 1.5 0 0 0 .14-2.67v-.645a48.549 48.549 0 0 1 3.44 1.667 2.25 2.25 0 0 0 2.12 0Z" />
        <path d="M4.462 19.462c.42-.419.753-.89 1-1.395.453.214.902.435 1.347.662a6.742 6.742 0 0 1-1.286 1.794.75.75 0 0 1-1.06-1.06Z" />
      </svg>,
  };

  export const personalData = {
    'Дата рождения': '11.12.1981',
    'Возраст': '42',
    'Адрес': 'РФ, г. Санкт-Петербург',
    'Email': <a href="mailto:doberman24@yandex.ru">doberman24@yandex.ru</a>,
    'Телефон': <a href="tel:+7-921-331-2439">+7(921)-331-24-39</a>,
    'Telegram': <a href="tg://resolve?domain=@it_to_move">@it_to_move</a>,
  };

  export const skills = {
    'HTML': [80, 'Структура HTML документа', 'Формы', 'Теги и атрибуты', 'Симантика и валидация'],
    'CSS': [70, 'Понятие потока документа', 'Flexbox и Grid', 'Медиа запросы', 'Селекторы, псевдоэлементы и псевдоклассы'],
    'JavaScript': [55, 'Async/await, promise', 'DOM-структура, события', 'Базовые конструкции и типы данных', 'Использование возможностей ES6'],
    'ReactJS': [50, 'Обработка событий', 'Создание компонентов', 'Управление состоянием через React Hooks'],
    'Tailwind': [70, 'Применение стилей', 'Flexbox и Grid', 'Установка окружения', 'Адаптивность', 'Кастмные настройки'],
    'GIT': [75, 'Основные команды', 'Работа с репозиториями', 'Ветки, merge и rebase']
  };

  export const addSkills = {
    'Дополнительные навыки': ['Internet, Web и HTTP', 'Опыт работы с ОС Linux', 'Базовые знания ЯП Python и оболочки Bash (создание инструментов для работы)', 'Знания общей структуры популярных CMS - Wordpress, Bitrix и т.д.'],
    'В процессе/в планах изучить': ['Vue.js', 'Nuxt.js', 'TypeScript', 'Совершенствование текущих навыков']
  };

  export const projects = [
    {
      'name': 'Простой калькулятор',
      'preview': 'calc.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный учебный проект',
      'type': 'js',
      'descrption': 'Калькулятор с простым функционалом обычного калькулятора. Логика написана на JavaScript. Небольшой проект для практики с DOM-структурой и событиями.',
    },
    {
      'name': 'Прогноз погоды',
      'preview': 'weather.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный учебный проект',
      'type': 'js',
      'descrption': 'Приложение прогноза погоды на текущее время и ближайщие 4 дня. Логика на Javascript. Практика использования асинхронных функции async/await и простых сетевых запросов с помощью fetch. А также, практика с адаптивностью.',
    },
    {
      'name': 'База автомобилей',
      'preview': 'cars.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный учебный проект',
      'type': 'full',
      'descrption': 'Поиск автомобилей в базе данных, добавление, удаление, изменение данных. Приложение написано на ReactJS в качестве фронтенда, а для бекенда используется node.js. Практика работы с React, Node, MySQL и создание полноценного приложения.',
    },
    {
      'name': 'Мессенджер',
      'preview': 'messenger.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный учебный проект',
      'type': 'full',
      'descrption': 'Простенький мессенджер на JavaScript. Запросы отправляются на сервер, который возвращет ответ. Елементарный сервер на node.js и express, который возвращает 1 из 3-х ответов. Цель - попрактиковаться с JS, с node.js, и использовать сетевые заросы. В планах на сервер добавить нейросеть для ответов на вопросы',
    },
    {
      'name': 'Лавка',
      'preview': 'lavka.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный проект',
      'type': 'landing',
      'descrption': 'Разработка статичного лендинга на HTML и CSS для магазиана-лавки.',
    },
    {
      'name': 'Игра Memory',
      'preview': 'memory.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Учебный проект',
      'type': 'react',
      'descrption': 'Проект взят из курсов HTML Academy. Пиложение на ReactJS. Практика работы с React Hooks, обработкой событий и разворачивания приложения на React. В планах переделать приложение - добавить большье функционала и разнообразия.',
    },
    {
      'name': 'Калькулятор на ReactJS',
      'preview': 'calculator.samanig.ru' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собственный учебный проект',
      'type': 'react',
      'descrption': 'Еще один калькулятор, но на ReactJS. Практика работы с размещение компонентов, React Hooks, обработкой событий.',
    },
    {
      'name': 'Мой сайт-портфолио',
      'preview': 'cv' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Собсвенный проект',
      'type': 'react',
      'descrption': 'Проект-портфолио. Написан на React, для стилей используется Tailwind. Практика работы с данными библиотеками и создание полноценного сайта-резюме.',
    },
    {
      'name': 'Простой шаблон',
      'preview': 'Шаблон Новое Начало' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Pet-проект',
      'type': 'landing',
      'descrption': 'Один из первых шаблонов, написанных с использованием HTML и CSS. Практика верстки сайта.',
    },
    {
      'name': 'Шаблон лендинга',
      'preview': 'Шаблон Архитектура' ,
      'picUrl': require('../img/bg.jpg'),
      'purpose': 'Pet-проект',
      'type': 'landibg',
      'descrption': 'Еще один шаблон. Практика верстки, а также работа с отзывчивостью элементов при помощи JavaScript',
    },
  ];